# Parameters
nc: 3  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple
anchors:
#  - [ 5,6, 8,14, 15,11 ]  #4
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
#  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [ [ -1, 1, Conv, [64, 6, 2, 2] ],  # 0-P1/2
    [ -1, 1, Conv, [128,  3, 2] ],  # 1-P2/4
    [ -1, 3, C3, [128 ] ],          #2      1,128,64,64
    [ -1, 1, Conv, [256, 3, 2 ] ],  # 3-P3/8
    [ -1, 6, C3, [256 ] ],          #4      1,256,32,32
    [ -1, 1, Conv, [512, 3, 2 ] ],  # 5-P4/16
    [ -1, 9, C3, [512 ] ],          #6      1,512,16,16
    [ -1, 1, Conv, [1024, 3, 2 ] ],  # 7-P5/32
    [ -1, 3, C3, [1024 ] ],         #8      1,1024,8,8
    [ -1, 1, SPPF, [1024, 5 ] ],  # 9
  ]

# YOLOv5 v6.0 head
head:   
  [ 
    [ -1, 1, AttentionConv, [ 512, 1, 1, 1 ] ],
    [ -1, 1, nn.Upsample, [ None, 2, 'nearest' ] ],
    [ [ -1, 6 ] , 1, Concat, [ 1 ] ],  #12  16.16
    
    [ -1, 1, nn.Upsample, [ None, 2, 'nearest' ] ],
    [ [ -1, 4 ] , 1, Concat, [ 1 ] ],  #14  32,32
    
    [ -1, 1, nn.Upsample, [ None, 2, 'nearest' ] ],
    [ [ -1, 2 ] , 1, Concat, [ 1 ] ],  #16  64,64
    
    [ 12, 1, AttentionConv, [ 512, 1, 1, 1 ] ],  #17 512,16,16
    [ 14, 1, Conv, [ 256, 3, 2 ] ],  #18 256,16,16
    [ 16, 1, Conv, [ 128, 3, 2 ] ],  #19 128,32,32
    
    [ [ 17, 18 ] , 1, Concat, [ 1 ] ], 
    [ -1, 3, C3_IFResNet, [ 256, False ] ],  #21  256,16,16
    
    [ -1, 1, nn.Upsample, [ None, 2, 'nearest' ] ],  #22 256,32,32
    [ [ -1, 19 ] , 1, Concat, [ 1 ] ],
    [ -1, 3, C3_IFResNet, [ 128, False ] ],  #24
    
    
    [ [ 24, 21], 1, Detect, [ nc, anchors ] ],  # Detect(P3, P4, P5)


  ]

################################################################################

#Ours:YOLOv5+Structural optimization+LCFE+CFFIE
#     [ -1, 1, AttentionConv, [ 512, 3, 1, 1 ] ],
#     [ -1, 1, nn.Upsample, [ None, 2, 'nearest' ] ],
#     [ [ -1, 6 ] , 1, Concat, [ 1 ] ],  #12  16.16
    
#     [ -1, 1, nn.Upsample, [ None, 2, 'nearest' ] ],
#     [ [ -1, 4 ] , 1, Concat, [ 1 ] ],  #14  32,32
    
#     [ -1, 1, nn.Upsample, [ None, 2, 'nearest' ] ],
#     [ [ -1, 2 ] , 1, Concat, [ 1 ] ],  #16  64,64
    
#     [ 12, 1, AttentionConv, [ 512, 3, 1, 1 ] ],  #17 512,16,16
#     [ 14, 1, Conv, [ 256, 3, 2 ] ],  #18 256,16,16
#     [ 16, 1, Conv, [ 128, 3, 2 ] ],  #19 128,32,32
    
#     [ [ 17, 18 ] , 1, Concat, [ 1 ] ], 
#     [ -1, 3, C3_IFResNet, [ 256, False ] ],  #21  256,16,16
    
#     [ -1, 1, nn.Upsample, [ None, 2, 'nearest' ] ],  #22 256,32,32
#     [ [ -1, 19 ] , 1, Concat, [ 1 ] ],
#     [ -1, 3, C3_IFResNet, [ 128, False ] ],  #24
    
    
#     [ [ 24, 21], 1, Detect, [ nc, anchors ] ],  # Detect(P3, P4, P5)

################################################################################

#YOLOv5+CFFIE  exp2
#     [-1, 1, Conv, [512, 1, 1]],
#     [-1, 1, nn.Upsample, [None, 2, 'nearest']],
#     [[-1, 6], 1, Concat, [1]],  # cat backbone P4
#     [-1, 3, C3, [512, False]],  # 13

#     [-1, 1, Conv, [256, 1, 1]],
#     [-1, 1, nn.Upsample, [None, 2, 'nearest']],
#     [[-1, 4], 1, Concat, [1]],  # cat backbone P3
#     [-1, 3, C3_IFResNet, [256, False]],  # 17 (P3/8-small)

#     [-1, 1, Conv, [256, 3, 2]],
#     [[-1, 14], 1, Concat, [1]],  # cat head P4
#     [-1, 3, C3_IFResNet, [512, False]],  # 20 (P4/16-medium)

#     [-1, 1, Conv, [512, 3, 2]],
#     [[-1, 10], 1, Concat, [1]],  # cat head P5
#     [-1, 3, C3_IFResNet, [1024, False]],  # 23 (P5/32-large)

#     [[17, 20, 23], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)

################################################################################

#YOLOv5+Structural optimization+CFFIE  exp3
#     [ -1, 1, Conv, [ 512, 1, 1 ] ],
#     [ -1, 1, nn.Upsample, [ None, 2, 'nearest' ] ],
#     [ [ -1, 6 ] , 1, Concat, [ 1 ] ],  #12  16.16
    
#     [ -1, 1, nn.Upsample, [ None, 2, 'nearest' ] ],
#     [ [ -1, 4 ] , 1, Concat, [ 1 ] ],  #14  32,32
    
#     [ -1, 1, nn.Upsample, [ None, 2, 'nearest' ] ],
#     [ [ -1, 2 ] , 1, Concat, [ 1 ] ],  #16  64,64
    
#     [ 12, 3, C3, [ 512, False ] ],  #17 512,16,16
#     [ 14, 1, Conv, [ 256, 3, 2 ] ],  #18 256,16,16
#     [ 16, 1, Conv, [ 128, 3, 2 ] ],  #19 128,32,32
    
#     [ [ 17, 18 ] , 1, Concat, [ 1 ] ], 
#     [ -1, 3, C3_IFResNet, [ 256, False ] ],  #21  256,16,16
    
#     [ -1, 1, nn.Upsample, [ None, 2, 'nearest' ] ],  #22 256,32,32
#     [ [ -1, 19 ] , 1, Concat, [ 1 ] ],
#     [ -1, 3, C3_IFResNet, [ 128, False ] ],  #24
    
    
#     [ [ 24, 21], 1, Detect, [ nc, anchors ] ],  # Detect(P3, P4, P5)


################################################################################

#YOLOv5+LCFE exp4

#     [-1, 1, AttentionConv, [512, 3, 1, 1]],
#     [-1, 1, nn.Upsample, [None, 2, 'nearest']],
#     [[-1, 6], 1, Concat, [1]],  # cat backbone P4
#     [-1, 1, AttentionConv, [512, 3, 1, 1]],  # 13

#     [-1, 1, AttentionConv, [256, 3, 1, 1]],
#     [-1, 1, nn.Upsample, [None, 2, 'nearest']],
#     [[-1, 4], 1, Concat, [1]],  # cat backbone P3
#     [-1, 3, C3, [256, False]],  # 17 (P3/8-small)

#     [-1, 1, Conv, [256, 3, 2]],
#     [[-1, 14], 1, Concat, [1]],  # cat head P4
#     [-1, 3, C3, [512, False]],  # 20 (P4/16-medium)

#     [-1, 1, Conv, [512, 3, 2]],
#     [[-1, 10], 1, Concat, [1]],  # cat head P5
#     [-1, 3, C3, [1024, False]],  # 23 (P5/32-large)

#     [[17, 20, 23], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)


################################################################################

#YOLOv5+Structural optimization+LCFE  exp6

#     [ -1, 1, AttentionConv, [ 512, 3, 1, 1 ] ],
#     [ -1, 1, nn.Upsample, [ None, 2, 'nearest' ] ],
#     [ [ -1, 6 ] , 1, Concat, [ 1 ] ],  #12  16.16
    
#     [ -1, 1, nn.Upsample, [ None, 2, 'nearest' ] ],
#     [ [ -1, 4 ] , 1, Concat, [ 1 ] ],  #14  32,32
    
#     [ -1, 1, nn.Upsample, [ None, 2, 'nearest' ] ],
#     [ [ -1, 2 ] , 1, Concat, [ 1 ] ],  #16  64,64
    
#     [ 12, 1, AttentionConv, [ 512, 3, 1, 1 ] ],  #17 512,16,16
#     [ 14, 1, Conv, [ 256, 3, 2 ] ],  #18 256,16,16
#     [ 16, 1, Conv, [ 128, 3, 2 ] ],  #19 128,32,32
    
#     [ [ 17, 18 ] , 1, Concat, [ 1 ] ], 
#     [ -1, 3, C3, [ 256, False ] ],  #21  256,16,16
    
#     [ -1, 1, nn.Upsample, [ None, 2, 'nearest' ] ],  #22 256,32,32
#     [ [ -1, 19 ] , 1, Concat, [ 1 ] ],
#     [ -1, 3, C3, [ 128, False ] ],  #24
    
    
#     [ [ 24, 21], 1, Detect, [ nc, anchors ] ],  # Detect(P3, P4, P5)


################################################################################

#YOLOv5+LCFE+CFFIE exp5

#     [-1, 1, AttentionConv, [512, 3, 1, 1]],
#     [-1, 1, nn.Upsample, [None, 2, 'nearest']],
#     [[-1, 6], 1, Concat, [1]],  # cat backbone P4
#     [-1, 1, AttentionConv, [512, 3, 1, 1]],  # 13

#     [-1, 1, AttentionConv, [256, 3, 1, 1]],
#     [-1, 1, nn.Upsample, [None, 2, 'nearest']],
#     [[-1, 4], 1, Concat, [1]],  # cat backbone P3
#     [-1, 3, C3_IFResNet, [256, False]],  # 17 (P3/8-small)

#     [-1, 1, Conv, [256, 3, 2]],
#     [[-1, 14], 1, Concat, [1]],  # cat head P4
#     [-1, 3, C3_IFResNet, [512, False]],  # 20 (P4/16-medium)

#     [-1, 1, Conv, [512, 3, 2]],
#     [[-1, 10], 1, Concat, [1]],  # cat head P5
#     [-1, 3, C3_IFResNet, [1024, False]],  # 23 (P5/32-large)

#     [[17, 20, 23], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)